# CannotCreateSpline Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SplineFailures..::..CannotCreateSpline Property
BuiltInFailures..::..SplineFailures Class See Also
---
Can't make Spline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateSpline { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateSpline As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateSpline {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SplineFailures Class
Autodesk.Revit.DB Namespace